Revit 2024 API
HVACLoadSpaceType.IsNameUnique Method (String)
 Determines whether a potential space type name is unique.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public bool IsNameUnique(
	string name
)
Visual Basic
Public Function IsNameUnique ( _
	name As String _
) As Boolean
Visual C++
public:
bool IsNameUnique(
	String^ name
)
Parameters
name
Type: System.String
 The candidate name.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
HVACLoadSpaceType Class
IsNameUnique Overload
Autodesk.Revit.DB.Analysis Namespace